### Qual desempenho das escolas de São Paulo nos últimos 10 anos, de acordo com o IDESP.

 Sobre a pesquisa: O IDESP é um indicador que avalia a qualidade das escolas. Nele, considera–se que uma boa escola é aquela em que a maior parte dos alunos aprende as competências e habilidades requeridas para a sua série/ano, num período de tempo ideal – o ano letivo.
 
 O problema, no entanto, é que a falta de clareza sobre o que fazer com os dados coletados dificulta a tomada decisão em relação a políticas públicas efetivas. Nesse estudo tento limpar, organizar e analisar os dados para trazer insights úteis para que o IDESP seja de fato utilizado na melhoria do ensino no Estado de São Paulo.

In [36]:
import pandas as pd
import numpy as np

In [37]:
df_1 = pd.read_csv("C:\\Users\\T-Gamer\\Desktop\\IDESP\\IDESP_ESCOLA_2023.csv", sep= ';')
df_2 = pd.read_csv("C:\\Users\\T-Gamer\\Desktop\\IDESP\\IDESP_ESCOLA_2024.csv", sep= ';', encoding='latin-1')
df_final = pd.concat([df_1, df_2])

In [38]:
df_final.head()

,ANO,CODIGO_ESCOLA,CODIGO_INEP,CODIGO_DIRETORIA,NOME_DIRETORIA,NOME_ESCOLA,NOME_MUNICIPIO,ANOS_INICIAIS,ANOS_FINAIS
0,2023,12,35000012,10101,NORTE 1,AYRES DE MOURA PROFESSOR,SAO PAULO,NaN,"3,56"
1,2023,24,35000024,10101,NORTE 1,GAVIAO PEIXOTO BRIGADEIRO,SAO PAULO,"3,83","2,86"
2,2023,36,35000036,10101,NORTE 1,JOAO SOLIMEO,SAO PAULO,NaN,"1,75"
3,2023,48,35000048,10101,NORTE 1,WALFREDO ARANTES CALDAS PROFESSOR,SAO PAULO,NaN,NaN
4,2023,59,35000059,10101,NORTE 1,SEBASTIAO DE OLIVEIRA GUSMAO PROFESSOR,SAO PAULO,NaN,NaN

In [39]:
print ('### Informações gerais do DataSet:\n')
df.info()
print ('\n### Itens nulos:\n')
df_final.isnull().sum()

### Informações gerais do DataSet:

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5065 entries, 0 to 5064
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   ANO               5065 non-null   int64
 1   CODIGO_ESCOLA     5065 non-null   int64
 2   CODIGO_INEP       5065 non-null   int64
 3   CODIGO_DIRETORIA  5065 non-null   int64
 4   NOME_DIRETORIA    5065 non-null   object
 5   NOME_ESCOLA       5065 non-null   object
 6   NOME_MUNICIPIO    5065 non-null   object
 7   ANOS_INICIAIS     1346 non-null   object
 8   ANOS_FINAIS       3664 non-null   object
dtypes: int64(4), object(5)
memory usage: 356.3+ KB

### Itens nulos:

ANO                    0
CODIGO_ESCOLA          0
CODIGO_INEP            0
CODIGO_DIRETORIA       0
NOME_DIRETORIA         0
NOME_ESCOLA            0
NOME_MUNICIPIO         0
ANOS_INICIAIS       7488
ANOS_FINAIS         2804
dtype: int64

Os 'Anos iniciais' representam o começo do ensino fundamental

In [40]:
df_1.head()

,ANO,CODIGO_ESCOLA,CODIGO_INEP,CODIGO_DIRETORIA,NOME_DIRETORIA,NOME_ESCOLA,NOME_MUNICIPIO,ANOS_INICIAIS,ANOS_FINAIS
0,2023,12,35000012,10101,NORTE 1,AYRES DE MOURA PROFESSOR,SAO PAULO,NaN,"3,56"
1,2023,24,35000024,10101,NORTE 1,GAVIAO PEIXOTO BRIGADEIRO,SAO PAULO,"3,83","2,86"
2,2023,36,35000036,10101,NORTE 1,JOAO SOLIMEO,SAO PAULO,NaN,"1,75"
3,2023,48,35000048,10101,NORTE 1,WALFREDO ARANTES CALDAS PROFESSOR,SAO PAULO,NaN,NaN
4,2023,59,35000059,10101,NORTE 1,SEBASTIAO DE OLIVEIRA GUSMAO PROFESSOR,SAO PAULO,NaN,NaN